export const printKoboFormsAsCSV = () => {
//   const res = list
//     .map(_ => [
//       _.name,
//       _.url,
//       _.date_created,
//       _.date_modified,
//       _.date_deployed,
//       _.owner__username,
//       _.deployment__submission_count,
//       _.deployment__active,
//     ].map(_ => `"${_}"`).join(','))
//     .join('\n')
}


// const list = []
//   {
//     'url': 'https://kobo.humanitarianresponse.info/api/v2/assets/a5Ue2L8z6i4j6tuivjWVN2/',
//     'date_created': '2023-03-17T14:40:05.836534Z',
//     'date_modified': '2023-06-08T11:39:10.632087Z',
//     'date_deployed': '2023-04-14T07:47:07.995088Z',
//     'owner': 'https://kobo.humanitarianresponse.info/api/v2/users/meal_drc_ddg_ukr/',
//     'summary': {
//       'geo': false,
//       'labels': [
//         '1. Інформована згода',
//         'Вітаємо від  Данської Ради у справах біженців! Ми хочемо задати вам кілька запитань, щоб отримати інформацію про грошову допомогу, яку Ви та ваша сім\'я отримали від нас. Ми хочемо почути ваші думки, щоб ми могли поліпшити свою роботу. Ваша участь є добровільною, і відповідь на запитання займе близько 20 хвилин. Якщо Ви погодитесь на інтерв\'ю, у Вас є можливість перестати відповідати або не відповідати на будь-яке питання, якщо Ви не бажаєте. Ця інформація допоможе нам зрозуміти, що було зроблено належним чином, що не спрацювало,  і що ми повинні робити по-іншому в процесі видачі грошової допомоги. Інформація, якою Ви ділитеся, буде захищена і буде передана лише невеликій групі людей у нашій організації. Будь ласка, знайте, що якщо Ви надасте негативні відгуки про нашу роботу, це не матиме жодних негативних наслідків для вашої участі в тій чи іншій проектній діяльності нашої організації. ',
//         'Enter a date',
//         'Офіс, відповідальний за видачу грошової допомоги ',
